micropython/micropython/ports/stm32/extint.c
/// \method enable()
/// Enable a disabled interrupt.
STATIC mp_obj_t extint_obj_enable(mp_obj_t self_in) {
    extint_obj_t *self = MP_OBJ_TO_PTR(self_in);
    extint_enable(self->line);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extint_obj_enable_obj, extint_obj_enable);

/// \method disable()
/// Disable the interrupt associated with the ExtInt object.
/// This could be useful for debouncing.
STATIC mp_obj_t extint_obj_disable(mp_obj_t self_in) {
    extint_obj_t *self = MP_OBJ_TO_PTR(self_in);
    extint_disable(self->line);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extint_obj_disable_obj, extint_obj_disable);

/// \method swint()
/// Trigger the callback from software.
STATIC mp_obj_t extint_obj_swint(mp_obj_t self_in) {
    extint_obj_t *self = MP_OBJ_TO_PTR(self_in);
    extint_swint(self->line);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extint_obj_swint_obj,  extint_obj_swint);

// TODO document as a staticmethod
/// \classmethod regs()
/// Dump the values of the EXTI registers.
STATIC mp_obj_t extint_regs(void) {
    #if defined(STM32G0) || defined(STM32G4) || defined(STM32L4) || defined(STM32WB) || defined(STM32WL)
    printf("EXTI_IMR1   %08x\n", (unsigned int)EXTI->IMR1);
    printf("EXTI_IMR2   %08x\n", (unsigned int)EXTI->IMR2);
    printf("EXTI_EMR1   %08x\n", (unsigned int)EXTI->EMR1);
    printf("EXTI_EMR2   %08x\n", (unsigned int)EXTI->EMR2);
    printf("EXTI_RTSR1  %08x\n", (unsigned int)EXTI->RTSR1);
    printf("EXTI_RTSR2  %08x\n", (unsigned int)EXTI->RTSR2);
    printf("EXTI_FTSR1  %08x\n", (unsigned int)EXTI->FTSR1);
    printf("EXTI_FTSR2  %08x\n", (unsigned int)EXTI->FTSR2);
    printf("EXTI_SWIER1 %08x\n", (unsigned int)EXTI->SWIER1);
    printf("EXTI_SWIER2 %08x\n", (unsigned int)EXTI->SWIER2);
    #if defined(STM32G0)
    printf("EXTI_RPR1    %08x\n", (unsigned int)EXTI->RPR1);
    printf("EXTI_FPR1    %08x\n", (unsigned int)EXTI->FPR1);
    printf("EXTI_RPR2    %08x\n", (unsigned int)EXTI->RPR2);
    printf("EXTI_FPR2    %08x\n", (unsigned int)EXTI->FPR2);
    #else
    printf("EXTI_PR1    %08x\n", (unsigned int)EXTI->PR1);
    printf("EXTI_PR2    %08x\n", (unsigned int)EXTI->PR2);
    #endif
    #elif defined(STM32H7)
    printf("EXTI_IMR1   %08x\n", (unsigned int)EXTI_D1->IMR1);
    printf("EXTI_IMR2   %08x\n", (unsigned int)EXTI_D1->IMR2);
    printf("EXTI_IMR3   %08x\n", (unsigned int)EXTI_D1->IMR3);
    printf("EXTI_EMR1   %08x\n", (unsigned int)EXTI_D1->EMR1);
    printf("EXTI_EMR2   %08x\n", (unsigned int)EXTI_D1->EMR2);
    printf("EXTI_EMR3   %08x\n", (unsigned int)EXTI_D1->EMR3);
    printf("EXTI_RTSR1  %08x\n", (unsigned int)EXTI->RTSR1);
    printf("EXTI_RTSR2  %08x\n", (unsigned int)EXTI->RTSR2);
    printf("EXTI_RTSR3  %08x\n", (unsigned int)EXTI->RTSR3);
    printf("EXTI_FTSR1  %08x\n", (unsigned int)EXTI->FTSR1);
    printf("EXTI_FTSR2  %08x\n", (unsigned int)EXTI->FTSR2);
    printf("EXTI_FTSR3  %08x\n", (unsigned int)EXTI->FTSR3);
    printf("EXTI_SWIER1 %08x\n", (unsigned int)EXTI->SWIER1);
    printf("EXTI_SWIER2 %08x\n", (unsigned int)EXTI->SWIER2);
    printf("EXTI_SWIER3 %08x\n", (unsigned int)EXTI->SWIER3);
    printf("EXTI_PR1    %08x\n", (unsigned int)EXTI_D1->PR1);
    printf("EXTI_PR2    %08x\n", (unsigned int)EXTI_D1->PR2);
    printf("EXTI_PR3    %08x\n", (unsigned int)EXTI_D1->PR3);
    #else
    printf("EXTI_IMR   %08x\n", (unsigned int)EXTI->IMR);
    printf("EXTI_EMR   %08x\n", (unsigned int)EXTI->EMR);
    printf("EXTI_RTSR  %08x\n", (unsigned int)EXTI->RTSR);
    printf("EXTI_FTSR  %08x\n", (unsigned int)EXTI->FTSR);
    printf("EXTI_SWIER %08x\n", (unsigned int)EXTI->SWIER);
    printf("EXTI_PR    %08x\n", (unsigned int)EXTI->PR);
    #endif
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(extint_regs_fun_obj, extint_regs);
STATIC MP_DEFINE_CONST_STATICMETHOD_OBJ(extint_regs_obj, MP_ROM_PTR(&extint_regs_fun_obj));

/// \classmethod \constructor(pin, mode, pull, callback)
/// Create an ExtInt object:
///
///   - `pin` is the pin on which to enable the interrupt (can be a pin object or any valid pin name).
///   - `mode` can be one of:
///     - `ExtInt.IRQ_RISING` - trigger on a rising edge;
///     - `ExtInt.IRQ_FALLING` - trigger on a falling edge;
///     - `ExtInt.IRQ_RISING_FALLING` - trigger on a rising or falling edge.
///   - `pull` can be one of:
///     - `pyb.Pin.PULL_NONE` - no pull up or down resistors;
///     - `pyb.Pin.PULL_UP` - enable the pull-up resistor;
///     - `pyb.Pin.PULL_DOWN` - enable the pull-down resistor.
///   - `callback` is the function to call when the interrupt triggers.  The
///   callback function must accept exactly 1 argument, which is the line that
///   triggered the interrupt.
STATIC const mp_arg_t pyb_extint_make_new_args[] = {
    { MP_QSTR_pin,      MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
    { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
    { MP_QSTR_pull,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
    { MP_QSTR_callback, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
};
#define PYB_EXTINT_MAKE_NEW_NUM_ARGS MP_ARRAY_SIZE(pyb_extint_make_new_args)

STATIC mp_obj_t extint_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // type_in == extint_obj_type

    // parse args
    mp_arg_val_t vals[PYB_EXTINT_MAKE_NEW_NUM_ARGS];
    mp_arg_parse_all_kw_array(n_args, n_kw, args, PYB_EXTINT_MAKE_NEW_NUM_ARGS, pyb_extint_make_new_args, vals);

    extint_obj_t *self = mp_obj_malloc(extint_obj_t, type);
    self->line = extint_register(vals[0].u_obj, vals[1].u_int, vals[2].u_int, vals[3].u_obj, false);

    return MP_OBJ_FROM_PTR(self);
}

STATIC void extint_obj_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    extint_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "<ExtInt line=%u>", self->line);
}

STATIC const mp_rom_map_elem_t extint_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR_line),    MP_ROM_PTR(&extint_obj_line_obj) },
    { MP_ROM_QSTR(MP_QSTR_enable),  MP_ROM_PTR(&extint_obj_enable_obj) },
    { MP_ROM_QSTR(MP_QSTR_disable), MP_ROM_PTR(&extint_obj_disable_obj) },
    { MP_ROM_QSTR(MP_QSTR_swint),   MP_ROM_PTR(&extint_obj_swint_obj) },
    { MP_ROM_QSTR(MP_QSTR_regs),    MP_ROM_PTR(&extint_regs_obj) },

    // class constants
    /// \constant IRQ_RISING - interrupt on a rising edge
    /// \constant IRQ_FALLING - interrupt on a falling edge
    /// \constant IRQ_RISING_FALLING - interrupt on a rising or falling edge
    { MP_ROM_QSTR(MP_QSTR_IRQ_RISING),         MP_ROM_INT(GPIO_MODE_IT_RISING) },
    { MP_ROM_QSTR(MP_QSTR_IRQ_FALLING),        MP_ROM_INT(GPIO_MODE_IT_FALLING) },
    { MP_ROM_QSTR(MP_QSTR_IRQ_RISING_FALLING), MP_ROM_INT(GPIO_MODE_IT_RISING_FALLING) },
    { MP_ROM_QSTR(MP_QSTR_EVT_RISING),         MP_ROM_INT(GPIO_MODE_EVT_RISING) },
    { MP_ROM_QSTR(MP_QSTR_EVT_FALLING),        MP_ROM_INT(GPIO_MODE_EVT_FALLING) },
    { MP_ROM_QSTR(MP_QSTR_EVT_RISING_FALLING), MP_ROM_INT(GPIO_MODE_EVT_RISING_FALLING) },
};

STATIC MP_DEFINE_CONST_DICT(extint_locals_dict, extint_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    extint_type,
    MP_QSTR_ExtInt,
    MP_TYPE_FLAG_NONE,
    make_new, extint_make_new,
    print, extint_obj_print,
    locals_dict, &extint_locals_dict
    );

void extint_init0(void) {
    for (int i = 0; i < PYB_EXTI_NUM_VECTORS; i++) {
        if (MP_STATE_PORT(pyb_extint_callback)[i] == MP_OBJ_SENTINEL) {
            continue;
        }
        MP_STATE_PORT(pyb_extint_callback)[i] = mp_const_none;
        pyb_extint_mode[i] = EXTI_Mode_Interrupt;
    }
}

// Interrupt handler
void Handle_EXTI_Irq(uint32_t line) {
    if (__HAL_GPIO_EXTI_GET_FLAG(1 << line)) {
        __HAL_GPIO_EXTI_CLEAR_FLAG(1 << line);
        if (line < EXTI_NUM_VECTORS) {
            mp_obj_t *cb = &MP_STATE_PORT(pyb_extint_callback)[line];
            #if MICROPY_PY_NETWORK_CYW43 && defined(pyb_pin_WL_HOST_WAKE)
            if (pyb_extint_callback_arg[line] == MP_OBJ_FROM_PTR(pyb_pin_WL_HOST_WAKE)) {
                extern void (*cyw43_poll)(void);
                if (cyw43_poll) {
                    pendsv_schedule_dispatch(PENDSV_DISPATCH_CYW43, cyw43_poll);
                }
                return;
            }
            #endif
            if (*cb != mp_const_none) {
                // If it's a soft IRQ handler then just schedule callback for later
                if (!pyb_extint_hard_irq[line]) {
                    mp_sched_schedule(*cb, pyb_extint_callback_arg[line]);
                    return;
                }

                mp_sched_lock();
                // When executing code within a handler we must lock the GC to prevent
                // any memory allocations.  We must also catch any exceptions.
                gc_lock();
                nlr_buf_t nlr;
                if (nlr_push(&nlr) == 0) {
                    mp_call_function_1(*cb, pyb_extint_callback_arg[line]);
                    nlr_pop();
                } else {
                    // Uncaught exception; disable the callback so it doesn't run again.
                    *cb = mp_const_none;
                    extint_disable(line);
                    mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in ExtInt interrupt handler line %u\n", (unsigned int)line);
                    mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
                }
                gc_unlock();
                mp_sched_unlock();
            }
        }
    }
}

MP_REGISTER_ROOT_POINTER(mp_obj_t pyb_extint_callback[PYB_EXTI_NUM_VECTORS]);
